In [1]:

import mysql

In [2]:



import mysql.connector

In [4]:
exec(open("_0X_params.py").read())

In [5]:

cnx = mysql.connector.connect(user=xdbuser, 
                              password=xpw,
                              host=xdbhost,
                              database=xdbname
                             )

In [6]:

import numpy as np
import pandas as pd

In [7]:

xcursor = cnx.cursor()

xcursor.execute("SHOW TABLES")

result = xcursor.fetchall()

In [8]:

print(result)

[(bytearray(b'dataDictionary'),), (bytearray(b'metadata'),), (bytearray(b'nba_gameDate_1'),), (bytearray(b'nba_playersDate_1'),), (bytearray(b'nba_teamDate_1'),), (bytearray(b'nhl_gameDate_1'),), (bytearray(b'nhl_goaliesDate_1'),), (bytearray(b'nhl_playersDate_1'),), (bytearray(b'nhl_teamDate_1'),), (bytearray(b'ozone_data'),), (bytearray(b'ozone_data_test'),)]

In [9]:
it_result = iter(result)

for row in it_result:
    print(row)

(bytearray(b'dataDictionary'),)
(bytearray(b'metadata'),)
(bytearray(b'nba_gameDate_1'),)
(bytearray(b'nba_playersDate_1'),)
(bytearray(b'nba_teamDate_1'),)
(bytearray(b'nhl_gameDate_1'),)
(bytearray(b'nhl_goaliesDate_1'),)
(bytearray(b'nhl_playersDate_1'),)
(bytearray(b'nhl_teamDate_1'),)
(bytearray(b'ozone_data'),)
(bytearray(b'ozone_data_test'),)

In [10]:


xcursor.execute("SELECT * FROM nba_playersDate_1  LIMIT 100")

result = xcursor.fetchall()

dataset = pd.DataFrame(result)

dataset

      0         1    2  3                 4   5   6   7
0     1  20041102  DET  E  Richard Hamilton  42  15  15
1     2  20041102  DET  E       Ben Wallace  37  15   6
2     3  20041102  DET  E  Chauncey Billups  37  17  12
3     4  20041102  DET  E   Rasheed Wallace  34  24  18
4     5  20041102  DET  E   Tayshaun Prince  31  10  21
..  ...       ...  ... ..               ...  ..  ..  ..
95   96  20041103  MIL  E      Dan Gadzuric  22  11  -9
96   97  20041103  MIL  E         Joe Smith  21   7  -8
97   98  20041103  MIL  E     Zaza Pachulia  25  11  10
98   99  20041103  MIL  E     Desmond Mason  20   8   8
99  100  20041103  MIL  E        Toni Kukoč  20   5   5

[100 rows x 8 columns]

In [14]:

xqstr = "SELECT * FROM nba_gameDate_1  " + \
"JOIN nba_playersDate_1  " + \
     "ON " + \
        "(nba_gameDate_1.date=nba_playersDate_1.date AND nba_gameDate_1.VT=nba_playersDate_1.team)  " + \
           " OR " + \
        "(nba_gameDate_1.date=nba_playersDate_1.date AND nba_gameDate_1.HT=nba_playersDate_1.team)  " + \
"WHERE nba_playersDate_1.pts > 60" ;

In [15]:
xqstr

'SELECT * FROM nba_gameDate_1  JOIN nba_playersDate_1  ON (nba_gameDate_1.date=nba_playersDate_1.date AND nba_gameDate_1.VT=nba_playersDate_1.team)   OR (nba_gameDate_1.date=nba_playersDate_1.date AND nba_gameDate_1.HT=nba_playersDate_1.team)  WHERE nba_playersDate_1.pts > 60'

In [16]:

xcursor.execute(xqstr)

result = xcursor.fetchall()

In [17]:
#result

In [18]:
resultTable = pd.DataFrame(result)

In [19]:
print(resultTable)

      0         1    2    3  4  5    6      7      8       9   ...  \
0   1590  20051220  DAL  LAL  W  W  240  14402   99.6  18,997  ...
1   1823  20060122  TOR  LAL  E  W  240  14400   95.4  18,997  ...
2   3437  20070316  POR  LAL  W  W  265  15900   89.0  18,997  ...
3   5629  20090202  LAL  NYK  W  E  240  14400  102.5  19,763  ...
4  11468  20140124  CHA  NYK  E  E  240  14400   85.1  19,812  ...
5  11720  20140303  CHA  MIA  E  E  240  14400   86.7  19,727  ...
6  15594  20170324  PHX  BOS  W  E  240  14400  109.3  18,624  ...
7  17689  20190123  HOU  NYK  W  E  240  14400  100.0  18,819  ...
8  18063  20190322  SAS  HOU  W  W  240  14400   98.4  18,055  ...
9  18861  20200120  GSW  POR  W  W  265  15900  100.3  19,493  ...

                                               11                  12      13  \
0         STAPLES Center, Los Angeles, California 2005-12-20 22:30:00   32392
1         STAPLES Center, Los Angeles, California 2006-01-22 21:30:00   37078
2         STAPLES Center, Los Angeles, California 2007-03-16 22:30:00   69903
3  Madison Square Garden (IV), New York, New York 2009-02-02 19:30:00  114121
4  Madison Square Garden (IV), New York, New York 2014-01-24 19:30:00  234309
5          AmericanAirlines Arena, Miami, Florida 2014-03-03 19:30:00  239486
6                TD Garden, Boston, Massachusetts 2017-03-24 19:30:00  321502
7  Madison Square Garden (IV), New York, New York 2019-01-23 19:30:00  365961
8                   Toyota Center, Houston, Texas 2019-03-22 20:00:00  373841
9                   Moda Center, Portland, Oregon 2020-01-20 22:00:00  390776

         14   15 16               17  18  19  20
0  20051220  LAL  W      Kobe Bryant  32  62  35
1  20060122  LAL  W      Kobe Bryant  41  81  25
2  20070316  LAL  W      Kobe Bryant  49  65   4
3  20090202  LAL  W      Kobe Bryant  36  61  19
4  20140124  NYK  E  Carmelo Anthony  38  62  34
5  20140303  MIA  E     LeBron James  41  61  16
6  20170324  PHX  W     Devin Booker  44  70  -6
7  20190123  HOU  W     James Harden  40  61  19
8  20190322  HOU  W     James Harden  36  61  18
9  20200120  POR  W   Damian Lillard  45  61  13

[10 rows x 21 columns]